TwoPhaseFlow-master/run/benchmark/phaseChange/scriven3D/scriven3D/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (0.5 0 0)
    (0.5 0.5 0)
    (0 0.5 0)
    (0 0 0.5)
    (0.5 0 0.5)
    (0.5 0.5 0.5)
    (0 0.5 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50)
    simpleGrading (1 1 1)
);

patches
(
    symmetry faceWall
    (
      (0 4 7 3)
      (0 1 2 3)
      (1 5 4 0)
    )

    patch outlet
    (
      (2 6 5 1)
      (4 5 6 7)
      (3 7 6 2)
    )

    empty frontAndBack
    (
    )
);

// ************************************************************************* //
